app/Http/Controllers/AuthController.php

insert into "users" ("name", "email", "password", "updated_at", "created_at") values ('jofiel', 'jofiel.ramirez@uabc.edu.mx', '$2y$12$jKFKiuSk8Uvdvveo/uf1hesrgBbJuhLb7Rt/7zaZSIWO.jFA8uFc2', '2026-05-20 07:17:56', '2026-05-20 07:17:56')
---
    public function register(Request $request): RedirectResponse
    {
        $data = $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'email', 'max:255', 'unique:users,email'],
            'password' => ['required', 'string', 'min:6', 'confirmed'],
        ]);

        $user = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);