app/Http/Controllers/CartController.php

select * from "cart_items" where "cart_items"."user_id" = 1 and "cart_items"."user_id" is not null order by "created_at" desc
---
    public function index(): View
    {
        $items = Auth::user()->cartItems()->latest()->get();

select exists(select * from "cart_items" where "cart_items"."user_id" = 1 and "cart_items"."user_id" is not null and "deal_id" = 'Uk9pH81+gPUwbkh9YzwMnYLT+/EaktqN8AgwMr6Y2wQ=') as "exists"
select exists(select * from "library_items" where "library_items"."user_id" = 1 and "library_items"."user_id" is not null and "deal_id" = 'Uk9pH81+gPUwbkh9YzwMnYLT+/EaktqN8AgwMr6Y2wQ=') as "exists"
insert into "cart_items" ("deal_id", "game_id", "title", "thumb", "sale_price", "normal_price", "user_id", "updated_at", "created_at") values ('Uk9pH81+gPUwbkh9YzwMnYLT+/EaktqN8AgwMr6Y2wQ=', '227942', 'Disco Elysium - The Final Cut', 'https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/632470/capsule_231x87.jpg?t=1779404536', 9.99, 39.99, 1, '2026-05-25 06:34:40', '2026-05-25 06:34:40')
---
    public function add(Request $request): RedirectResponse
    {
        $data = $request->validate([
            'deal_id' => ['required', 'string', 'max:255'],
        ]);

        $user = Auth::user();

        if ($user->cartItems()->where('deal_id', $data['deal_id'])->exists()) {
            return back()->with('status', 'Este juego ya está en tu carrito.');
        }

        if ($user->libraryItems()->where('deal_id', $data['deal_id'])->exists()) {
            return back()->with('status', 'Ya tienes este juego en tu biblioteca.');
        }

        $deal = $this->cheapShark->getDeal($data['deal_id']);

        if (! $deal || empty($deal['gameInfo'])) {
            return back()->withErrors(['deal' => 'No se pudo cargar la información del juego.']);
        }

        $info = $deal['gameInfo'];

        $user->cartItems()->create([
            'deal_id' => $data['deal_id'],
            'game_id' => $info['gameID'] ?? null,
            'title' => $info['name'] ?? 'Juego sin título',
            'thumb' => $info['thumb'] ?? null,
            'sale_price' => (float) ($info['salePrice'] ?? 0),
            'normal_price' => (float) ($info['retailPrice'] ?? 0),
        ]);

delete from "cart_items" where "id" = 1
---
    public function remove(CartItem $cartItem): RedirectResponse
    {
        abort_if($cartItem->user_id !== Auth::id(), 403);

        $cartItem->delete();

select * from "cart_items" where "cart_items"."user_id" = 1 and "cart_items"."user_id" is not null and "id" in ('5')
insert into "library_items" ("deal_id", "game_id", "title", "thumb", "purchase_price", "purchased_at", "user_id", "updated_at", "created_at") values ('yiJ++Qm1oghJrTjJJ7BUKdpTlOrbBKCkOYw67UHarPE=', '173596', 'Frostpunk', 'https://shared.fastly.steamstatic.com/store_item_assets/steam/apps/323190/45bfdc7f6b60b2acab44cc96c488f938219c42fd/capsule_231x87.jpg?t=1775495730', '2.99', '2026-05-25 06:34:53', 1, '2026-05-25 06:34:53', '2026-05-25 06:34:53')
delete from "cart_items" where "id" = 5
---
    public function checkout(Request $request): RedirectResponse
    {
        $data = $request->validate([
            'item_ids' => ['required', 'array', 'min:1'],
            'item_ids.*' => ['integer'],
        ]);

        $user = Auth::user();

        DB::transaction(function () use ($user, $data) {
            $items = $user->cartItems()->whereIn('id', $data['item_ids'])->get();

            foreach ($items as $item) {
                $user->libraryItems()->create([
                    'deal_id' => $item->deal_id,
                    'game_id' => $item->game_id,
                    'title' => $item->title,
                    'thumb' => $item->thumb,
                    'purchase_price' => $item->sale_price,
                    'purchased_at' => now(),
                ]);
                $item->delete();