app/Http/Controllers/LibraryController.php

select * from "library_items" where "library_items"."user_id" = 1 and "library_items"."user_id" is not null order by "purchased_at" desc
---
    public function index(Request $request): View
    {
        $search = trim((string) $request->query('search', ''));

        $query = Auth::user()->libraryItems()->latest('purchased_at');

        if ($search !== '') {
            $query->where('title', 'like', '%'.$search.'%');
        }

        $items = $query->get();